---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerCommunicationException
source: html/e3a87e4e-6453-6e6b-da5b-8316c40cf46a.htm
---
# RevitServerCommunicationException Methods

Retrieves data needed to serialize the target object.